[
  {
    "id": "pub9",
    "title": "Multi-scale intervention planning based on generative design",
    "authors": "I Kavouras, I Rallis, E Sardis, E Protopapadakis, A Doulamis, N Doulamis",
    "year": 2024,
    "source": "https://doi.org/10.1007/978-3-031-63031-6_20",
    "pdf": "assets/publications/pub9.pdf",
    "bibtex": "@InProceedings{kavouras_multi_2024,\nauthor=\"Kavouras, Ioannis\nand Rallis, Ioannis\nand Sardis, Emmanuel\nand Protopapadakis, Eftychios\nand Doulamis, Anastasios\nand Doulamis, Nikolaos\",\neditor=\"Sifaleras, Angelo\nand Lin, Fuhua\",\ntitle=\"Multi-scale Intervention Planning Based on Generative Design\",\nbooktitle=\"Generative Intelligence and Intelligent Tutoring Systems\",\nyear=\"2024\",\npublisher=\"Springer Nature Switzerland\",\naddress=\"Cham\",\npages=\"225--233\",\nabstract=\"The scarcity of green spaces, in urban environments, consists a critical challenge. There are multiple adverse effects, impacting the health and well-being of the citizens. Small scale interventions, e.g. pocket parks, is a viable solution, but comes with multiple constraints, involving the design and implementation over a specific area. In this study, we harness the capabilities of generative AI for multi-scale intervention planning, focusing on nature based solutions. By leveraging image-to-image and image inpainting algorithms, we propose a methodology to address the green space deficit in urban areas. Focusing on two alleys in Thessaloniki, where greenery is lacking, we demonstrate the efficacy of our approach in visualizing NBS interventions. Our findings underscore the transformative potential of emerging technologies in shaping the future of urban intervention planning processes.\",\nisbn=\"978-3-031-63031-6\"\n}",
    "citation": "Kavouras, I., Rallis, I., Sardis, E., Protopapadakis, E., Doulamis, A., Doulamis, N. (2024). Multi-scale Intervention Planning Based on Generative Design. In: Sifaleras, A., Lin, F. (eds) Generative Intelligence and Intelligent Tutoring Systems. ITS 2024. Lecture Notes in Computer Science, vol 14799. Springer, Cham. https://doi.org/10.1007/978-3-031-63031-6_20"
  },
  {
    "id": "pub8",
    "title": "Dynamically tangible cultural heritage monitoring from web video sources",
    "authors": "I Kavouras, R Ioannis, N Doulamis, A Doulamis",
    "year": 2023,
    "source": "https://doi.org/10.1145/3594806.3596552",
    "pdf": "assets/publications/pub2.pdf",
    "bibtex": "@inproceedings{kavouras_dynamically_2023,\nauthor = {Kavouras, Ioannis and Ioannis, Rallis and Doulamis, Nikolaos and Doulamis, Anastasios},\ntitle = {Dynamically tangible cultural heritage monitoring from web video sources},\nyear = {2023},\nisbn = {9798400700699},\npublisher = {Association for Computing Machinery},\naddress = {New York, NY, USA},\nurl = {https://doi.org/10.1145/3594806.3596552},\ndoi = {10.1145/3594806.3596552},\nabstract = {Climate change is serious problem, which can negatively affect the tangible cultural heritage. An actively solution to this problem is the long-term continuous monitoring of the cultural heritage, which is impossible in many cases. In this work we propose a methodology based on web video sources for generating high fidelity 3D meshes and estimating geometrically changes, which can indicate possible damaged areas. The ancient theatre of Epidaurus was selected for demonstrating the methodology and by using two YouTube video sources, high fidelity meshes were generated and compared by using free and open-source software. This work concludes on that tangible cultural heritage monitoring is possible by using web video sources.},\nbooktitle = {Proceedings of the 16th International Conference on PErvasive Technologies Related to Assistive Environments},\npages = {610–616},\nnumpages = {7},\nkeywords = {3D, climate change, monitoring, structure from motion, tangible cultural heritage},\nlocation = {Corfu, Greece},\nseries = {PETRA '23}\n}",
    "citation": "Ioannis Kavouras, Rallis Ioannis, Nikolaos Doulamis, and Anastasios Doulamis. 2023. Dynamically tangible cultural heritage monitoring from web video sources. In Proceedings of the 16th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '23). Association for Computing Machinery, New York, NY, USA, 610–616. https://doi.org/10.1145/3594806.3596552"
  },
  {
    "id": "pub7",
    "title": "A low-cost gamified urban planning methodology enhanced with co-creation and participatory approaches",
    "authors": "I Kavouras, E Sardis, E Protopapadakis, I Rallis, A Doulamis, N Doulamis",
    "year": 2023,
    "source": "https://doi.org/10.3390/su15032297",
    "pdf": "assets/publications/pub7.pdf",
    "bibtex": "@Article{kavouras_low_2023,\nAUTHOR = {Kavouras, Ioannis and Sardis, Emmanuel and Protopapadakis, Eftychios and Rallis, Ioannis and Doulamis, Anastasios and Doulamis, Nikolaos},\nTITLE = {A Low-Cost Gamified Urban Planning Methodology Enhanced with Co-Creation and Participatory Approaches},\nJOURNAL = {Sustainability},\nVOLUME = {15},\nYEAR = {2023},\nNUMBER = {3},\nARTICLE-NUMBER = {2297},\nURL = {https://www.mdpi.com/2071-1050/15/3/2297},\nISSN = {2071-1050},\nABSTRACT = {Targeted nature-based small-scale interventions is an approach commonly adopted by urban developers. The public acceptance of their implementation could be improved by participation, emphasizing residents or shopkeepers located close to the areas of interest. In this work, we propose a methodology that combines 3D technology, based on open data sources, user-generated content, 3D software and game engines for both minimizing the time and cost of the whole planning process and enhancing citizen participation. The proposed schemes are demonstrated in Piraeus (Greece) and Gladsaxe (Denmark). The core findings can be summarized as follows: (a) the time and cost are minimized by using online databases, (b) the gamification of the planning process enhances the decision making process and (c) the interactivity provided by the game engine inspired the participation of non-experts in the planning process (co-creation and co-evaluation), which decentralizes and democratizes the final planning solution.},\nDOI = {10.3390/su15032297}\n}",
    "citation": "Kavouras, Ioannis, Emmanuel Sardis, Eftychios Protopapadakis, Ioannis Rallis, Anastasios Doulamis, and Nikolaos Doulamis. 2023. \"A Low-Cost Gamified Urban Planning Methodology Enhanced with Co-Creation and Participatory Approaches\" Sustainability 15, no. 3: 2297. https://doi.org/10.3390/su15032297"
  },
  {
    "id": "pub6",
    "title": "Effectiveness of Open-Source Solutions for Limited Scale Interventions Planning",
    "authors": "I Kavouras, E Sardis, E Protopapadakis, A Doulamis",
    "year": 2022,
    "source": "https://doi.org/10.1007/978-3-031-17601-2_11",
    "pdf": "assets/publications/pub6.pdf",
    "bibtex": "@InProceedings{kavouras_effectiveness_2022,\nauthor=\"Kavouras, Ioannis\nand Sardis, Emmanuel\nand Protopapadakis, Eftychios\nand Doulamis, Anastasios\",\neditor=\"Krouska, Akrivi\nand Troussas, Christos\nand Caro, Jaime\",\ntitle=\"Effectiveness of Open-Source Solutions for Limited Scale Interventions Planning\",\nbooktitle=\"Novel {\\&} Intelligent Digital Systems: Proceedings of the 2nd International Conference (NiDS 2022)\",\nyear=\"2023\",\npublisher=\"Springer International Publishing\",\naddress=\"Cham\",\npages=\"104--112\",\nabstract=\"In this work we investigate how combining open-source game engines and graphic-related software can support planning and interventions in multiple scales, starting from something as small as a room. The proposed methodology allows the creation of a high fidelity 3D mesh representation of reality, using a small dataset, together with photogrammetric and topographic techniques. The 3D mesh can be imported to a game engine and be used during planning. The case study deals with the creation of a storage furniture setup, inside a small room, following a number of manufacturing restrictions. The storage space is designed using proposed tools. Manufactured items required minor to none changes, during assembly.\",\nisbn=\"978-3-031-17601-2\"\n}",
    "citation": "Kavouras, I., Sardis, E., Protopapadakis, E., Doulamis, A. (2023). Effectiveness of Open-Source Solutions for Limited Scale Interventions Planning. In: Krouska, A., Troussas, C., Caro, J. (eds) Novel & Intelligent Digital Systems: Proceedings of the 2nd International Conference (NiDS 2022). NiDS 2022. Lecture Notes in Networks and Systems, vol 556. Springer, Cham. https://doi.org/10.1007/978-3-031-17601-2_11"
  },
  {
    "id": "pub5",
    "title": "Evaluating the feasibility of fast game development using open source tools and AI algorithms",
    "authors": "I Kavouras, I Rallis, A Doulamis, N Doulamis",
    "year": 2022,
    "source": "https://doi.org/10.1007/978-3-031-17601-2_13",
    "pdf": "assets/publications/pub5.pdf",
    "bibtex": "@InProceedings{kavouras_evaluating_2022,\nauthor=\"Kavouras, Ioannis\nand Rallis, Ioannis\nand Doulamis, Anastasios\nand Doulamis, Nikolaos\",\neditor=\"Krouska, Akrivi\nand Troussas, Christos\nand Caro, Jaime\",\ntitle=\"Evaluating the Feasibility of Fast Game Development Using Open Source Tools and AI Algorithms\",\nbooktitle=\"Novel {\\&} Intelligent Digital Systems: Proceedings of the 2nd International Conference (NiDS 2022)\",\nyear=\"2023\",\npublisher=\"Springer International Publishing\",\naddress=\"Cham\",\npages=\"124--133\",\nabstract=\"Video games designer production is boosted, in recent years, by the evolution in hardware and software domains. Today is easier than ever to use multiple free and open-source softwares, libraries and frameworks for the creation of a game. In this work we describe a simple pipeline for the creation of a hand game emulator, using exclusively free and open-source tools. This is achieved by combining different visualization and rendering tools, such as Blender and Gimp to create simple graphics, as well as python libraries, such as PyQt5, OpenGL and Tensorflow to create the game's interface and AI decision mechanisms. In less than 48 h, a full featured Rock-Paper-Scissors game has been created. The game supports multiple ways for input, ranging from point and click in the UI, to hand-gestured recognition from RGB cameras.\",\nisbn=\"978-3-031-17601-2\"\n}",
    "citation": "Kavouras, I., Rallis, I., Doulamis, A., Doulamis, N. (2023). Evaluating the Feasibility of Fast Game Development Using Open Source Tools and AI Algorithms. In: Krouska, A., Troussas, C., Caro, J. (eds) Novel & Intelligent Digital Systems: Proceedings of the 2nd International Conference (NiDS 2022). NiDS 2022. Lecture Notes in Networks and Systems, vol 556. Springer, Cham. https://doi.org/10.1007/978-3-031-17601-2_13"
  },
  {
    "id": "pub4",
    "title": "COVID-19 spatio-temporal evolution using deep learning at a European level",
    "authors": "Ioannis Kavouras, Maria Kaselimi, Eftychios Protopapadakis, Nikolaos Bakalos, Nikolaos Doulamis, Anastasios Doulamis",
    "year": 2022,
    "source": "https://doi.org/10.3390/s22103658",
    "pdf": "assets/publications/pub4.pdf",
    "bibtex": "@Article{kavouras_covid_2022,\nAUTHOR = {Kavouras, Ioannis and Kaselimi, Maria and Protopapadakis, Eftychios and Bakalos, Nikolaos and Doulamis, Nikolaos and Doulamis, Anastasios},\nTITLE = {COVID-19 Spatio-Temporal Evolution Using Deep Learning at a European Level},\nJOURNAL = {Sensors},\nVOLUME = {22},\nYEAR = {2022},\nNUMBER = {10},\nARTICLE-NUMBER = {3658},\nURL = {https://www.mdpi.com/1424-8220/22/10/3658},\nPubMedID = {35632066},\nISSN = {1424-8220},\nABSTRACT = {COVID-19 evolution imposes significant challenges for the European healthcare system. The heterogeneous spread of the pandemic within EU regions elicited a wide range of policies, such as school closure, transport restrictions, etc. However, the implementation of these interventions is not accompanied by the implementation of quantitative methods, which would indicate their effectiveness. As a result, the efficacy of such policies on reducing the spread of the virus varies significantly. This paper investigates the effectiveness of using deep learning paradigms to accurately model the spread of COVID-19. The deep learning approaches proposed in this paper are able to effectively map the temporal evolution of a COVID-19 outbreak, while simultaneously taking into account policy interventions directly into the modelling process. Thus, our approach facilitates data-driven decision making by utilizing previous knowledge to train models that predict not only the spread of COVID-19, but also the effect of specific policy measures on minimizing this spread. Global models at the EU level are proposed, which can be successfully applied at the national level. These models use various inputs in order to successfully model the spatio-temporal variability of the phenomenon and obtain generalization abilities. The proposed models are compared against the traditional epidemiological and Autoregressive Integrated Moving Average (ARIMA) models.},\nDOI = {10.3390/s22103658}\n}",
    "citation": "Kavouras, Ioannis, Maria Kaselimi, Eftychios Protopapadakis, Nikolaos Bakalos, Nikolaos Doulamis, and Anastasios Doulamis. 2022. \"COVID-19 Spatio-Temporal Evolution Using Deep Learning at a European Level\" Sensors 22, no. 10: 3658. https://doi.org/10.3390/s22103658"
  },
  {
    "id": "pub3",
    "title": "Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution",
    "authors": "I Kavouras, M Kaselimi, E Protopapadakis, N Doulamis",
    "year": 2021,
    "source": "https://doi.org/10.1145/3453892.3461327",
    "pdf": "assets/publications/pub3.pdf",
    "bibtex": "@inproceedings{kavouras_machine_2021,\nauthor = {Kavouras, Ioannis and Kaselimi, Maria and Protopapadakis, Eftychios and Doulamis, Nikolaos},\ntitle = {Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution},\nyear = {2021},\nisbn = {9781450387927},\npublisher = {Association for Computing Machinery},\naddress = {New York, NY, USA},\nurl = {https://doi.org/10.1145/3453892.3461327},\ndoi = {10.1145/3453892.3461327},\nabstract = {In January, 2020, a new virus, named SARS-COV-2, was identified and announced to the public; in March the World Health Organization (WHO) declared a worldwide pandemic. To reduce the transmissibility of the new virus, the local authorities, worldwide, introduced a series of measures to flatten the curve. Many of the measures included some form of lockdown and movement restrictions. This unique coordinated worldwide reaction, created an opportunity for researching the effects of low traffic in air quality. In this work we research the relation between the COVID-19 measures and the Air Quality Index (AQI), using four pollutant gases (CO, O3, NO2, SO2). Also, we used a variety of machine learning tools (DNN, DTR, K-NN, Lasso, LReg, MAdam, MGBR, RFR, Ridge) to estimate the accuracy of each method in the prediction of the concentration for each gas one week later. The results showed that after the strict COVID-19 restriction measures the concentration of each pollutant gas reduced rapidly and increased again after the relaxation of lockdown measures. Finally in cases like Australia, where the measures weren’t as strict as other countries, no improvement observed.},\nbooktitle = {Proceedings of the 14th PErvasive Technologies Related to Assistive Environments Conference},\npages = {396–403},\nnumpages = {8},\nkeywords = {neural networks, machine learning, environmental quality, COVID-19},\nlocation = {Corfu, Greece},\nseries = {PETRA '21}\n}",
    "citation": "Ioannis Kavouras, Maria Kaselimi, Eftychios Protopapadakis, and Nikolaos Doulamis. 2021. Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution. In Proceedings of the 14th PErvasive Technologies Related to Assistive Environments Conference (PETRA '21). Association for Computing Machinery, New York, NY, USA, 396–403. https://doi.org/10.1145/3453892.3461327"
  },
  {
    "id": "pub2",
    "title": "Assessing the Lockdown Effects on Air Quality During COVID-19 Era",
    "authors": "I Kavouras, E Protopapadakis, M Kaselimi, E Sardis, N Doulamis",
    "year": 2021,
    "source": "https://ebooks.iospress.nl/doi/10.3233/FAIA210095",
    "pdf": "assets/publications/pub2.pdf",
    "bibtex": "@incollection{kavouras_assessing_2021,\n\ttitle = {Assessing the {Lockdown} {Effects} on {Air} {Quality} {During} {COVID}-19 {Era}},\n\turl = {https://ebooks.iospress.nl/doi/10.3233/FAIA210095},\n\tlanguage = {en},\n\turldate = {2025-10-23},\n\tbooktitle = {Novelties in {Intelligent} {Digital} {Systems}},\n\tpublisher = {IOS Press},\n\tauthor = {Kavouras, Ioannis and Protopapadakis, Eftychios and Kaselimi, Maria and Sardis, Emmanuel and Doulamis, Nikolaos},\n\tyear = {2021},\n\tdoi = {10.3233/FAIA210095},\n\tpages = {207--216},\n\tabstract = {In this work we investigate the short-term variations in air quality emissions, attributed to the prevention measures, applied in different cities, to mitigate the COVID-19 spread. In particular, we emphasize on the concentration effects regarding specific pollutant gases, such as carbon monoxide (CO), ozone (O3), nitrogen dioxide (NO2) and sulphur dioxide (SO2). The assessment of the impact of lockdown on air quality focused on four European Cities (Athens, Gladsaxe, Lodz and Rome). Available data on pollutant factors were obtained using global satellite observations. The level of the employed prevention measures is employed using the Oxford COVID-19 Government Response Tracker. The second part of the analysis employed a variety of machine learning tools, utilized for estimating the concentration of each pollutant, two days ahead. The results showed that a weak to moderate correlation exists between the corresponding measures and the pollutant factors and that it is possible to create models which can predict the behaviour of the pollutant gases under daily human activities.}\n}",
    "citation": "Kavouras, I., Protopapadakis, E., Kaselimi, M., Sardis, E., & Doulamis, N. (2021). Assessing the Lockdown Effects on Air Quality During COVID-19 Era. In Novelties in Intelligent Digital Systems (pp. 207-216). IOS Press."
  },
  {
    "id": "pub1",
    "title": "Skeleton extraction of dance sequences from 3D points using convolutional neural networks based on a new developed C3D visualization interface",
    "authors": "I Kavouras, E Protopapadakis, A Doulamis, N Doulamis",
    "year": 2018,
    "source": "https://doi.org/10.1007/978-3-030-11935-5_26",
    "pdf": "assets/publications/pub1.pdf",
    "bibtex": "@InProceedings{kavouras_skeleton_2018,\nauthor=\"Kavouras, Ioannis\nand Protopapadakis, Eftychios\nand Doulamis, Anastasios\nand Doulamis, Nikolaos\",\neditor=\"Auer, Michael E.\nand Tsiatsos, Thrasyvoulos\",\ntitle=\"Skeleton Extraction of Dance Sequences from 3D Points Using Convolutional Neural Networks Based on a New Developed C3D Visualization Interface\",\nbooktitle=\"The Challenges of the Digital Transformation in Education\",\nyear=\"2019\",\npublisher=\"Springer International Publishing\",\naddress=\"Cham\",\npages=\"267--279\",\nabstract=\"A combined approach, involving 3D spatial datasets, noise removal prepossessing and deep learning regression approaches for the estimation of rough skeleton data, is presented in this paper. The application scenario involved data sequences from Greek traditional dances. In particular, a visualization application interface was developed allowing the user to load the C3D sequences, edit the data and remove possible noise. The interface was developed using the OpenGL language and is able to parse aby C3D format file. The interface is supported by several functionalities such as a pre-processing of the 3D point data and noise removal of 3D points that fall apart from the human skeleton. The main research innovation of this paper is the use of a deep machine learning framework through which human skeleton can be extracted. The points are selected on the use of a Convolutional Neural Network (CNN) model. Experimental results on real-life dances being captured by the Vicon motion capturing system are presented to show the great performance of the proposed scheme.\",\nisbn=\"978-3-030-11935-5\"\n}",
    "citation": "Kavouras, I., Protopapadakis, E., Doulamis, A., Doulamis, N. (2019). Skeleton Extraction of Dance Sequences from 3D Points Using Convolutional Neural Networks Based on a New Developed C3D Visualization Interface. In: Auer, M., Tsiatsos, T. (eds) The Challenges of the Digital Transformation in Education. ICL 2018. Advances in Intelligent Systems and Computing, vol 917. Springer, Cham. https://doi.org/10.1007/978-3-030-11935-5_26"
  }
]