[
    {
    "id": "pub3",
    "title": "Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution",
    "authors": "I Kavouras, M Kaselimi, E Protopapadakis, N Doulamis",
    "year": 2021,
    "source": "https://doi.org/10.1145/3453892.3461327",
    "pdf": "assets/publications/pub3.pdf",
    "bibtex": "@inproceedings{kavouras_machine_2021,\nauthor = {Kavouras, Ioannis and Kaselimi, Maria and Protopapadakis, Eftychios and Doulamis, Nikolaos},\ntitle = {Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution},\nyear = {2021},\nisbn = {9781450387927},\npublisher = {Association for Computing Machinery},\naddress = {New York, NY, USA},\nurl = {https://doi.org/10.1145/3453892.3461327},\ndoi = {10.1145/3453892.3461327},\nabstract = {In January, 2020, a new virus, named SARS-COV-2, was identified and announced to the public; in March the World Health Organization (WHO) declared a worldwide pandemic. To reduce the transmissibility of the new virus, the local authorities, worldwide, introduced a series of measures to flatten the curve. Many of the measures included some form of lockdown and movement restrictions. This unique coordinated worldwide reaction, created an opportunity for researching the effects of low traffic in air quality. In this work we research the relation between the COVID-19 measures and the Air Quality Index (AQI), using four pollutant gases (CO, O3, NO2, SO2). Also, we used a variety of machine learning tools (DNN, DTR, K-NN, Lasso, LReg, MAdam, MGBR, RFR, Ridge) to estimate the accuracy of each method in the prediction of the concentration for each gas one week later. The results showed that after the strict COVID-19 restriction measures the concentration of each pollutant gas reduced rapidly and increased again after the relaxation of lockdown measures. Finally in cases like Australia, where the measures weren’t as strict as other countries, no improvement observed.},\nbooktitle = {Proceedings of the 14th PErvasive Technologies Related to Assistive Environments Conference},\npages = {396–403},\nnumpages = {8},\nkeywords = {neural networks, machine learning, environmental quality, COVID-19},\nlocation = {Corfu, Greece},\nseries = {PETRA '21}\n}",
    "citation": "Ioannis Kavouras, Maria Kaselimi, Eftychios Protopapadakis, and Nikolaos Doulamis. 2021. Machine Learning Tools to Assess the Impact of COVID-19 Civil Measures in Atmospheric Pollution. In Proceedings of the 14th PErvasive Technologies Related to Assistive Environments Conference (PETRA '21). Association for Computing Machinery, New York, NY, USA, 396–403. https://doi.org/10.1145/3453892.3461327"
  },
  {
    "id": "pub2",
    "title": "Assessing the Lockdown Effects on Air Quality During COVID-19 Era",
    "authors": "I Kavouras, E Protopapadakis, M Kaselimi, E Sardis, N Doulamis",
    "year": 2021,
    "source": "https://ebooks.iospress.nl/doi/10.3233/FAIA210095",
    "pdf": "assets/publications/pub2.pdf",
    "bibtex": "@incollection{kavouras_assessing_2021,\n\ttitle = {Assessing the {Lockdown} {Effects} on {Air} {Quality} {During} {COVID}-19 {Era}},\n\turl = {https://ebooks.iospress.nl/doi/10.3233/FAIA210095},\n\tlanguage = {en},\n\turldate = {2025-10-23},\n\tbooktitle = {Novelties in {Intelligent} {Digital} {Systems}},\n\tpublisher = {IOS Press},\n\tauthor = {Kavouras, Ioannis and Protopapadakis, Eftychios and Kaselimi, Maria and Sardis, Emmanuel and Doulamis, Nikolaos},\n\tyear = {2021},\n\tdoi = {10.3233/FAIA210095},\n\tpages = {207--216},\n\tabstract = {In this work we investigate the short-term variations in air quality emissions, attributed to the prevention measures, applied in different cities, to mitigate the COVID-19 spread. In particular, we emphasize on the concentration effects regarding specific pollutant gases, such as carbon monoxide (CO), ozone (O3), nitrogen dioxide (NO2) and sulphur dioxide (SO2). The assessment of the impact of lockdown on air quality focused on four European Cities (Athens, Gladsaxe, Lodz and Rome). Available data on pollutant factors were obtained using global satellite observations. The level of the employed prevention measures is employed using the Oxford COVID-19 Government Response Tracker. The second part of the analysis employed a variety of machine learning tools, utilized for estimating the concentration of each pollutant, two days ahead. The results showed that a weak to moderate correlation exists between the corresponding measures and the pollutant factors and that it is possible to create models which can predict the behaviour of the pollutant gases under daily human activities.}\n}",
    "citation": "Kavouras, I., Protopapadakis, E., Kaselimi, M., Sardis, E., & Doulamis, N. (2021). Assessing the Lockdown Effects on Air Quality During COVID-19 Era. In Novelties in Intelligent Digital Systems (pp. 207-216). IOS Press."
  },
  {
    "id": "pub1",
    "title": "Skeleton extraction of dance sequences from 3D points using convolutional neural networks based on a new developed C3D visualization interface",
    "authors": "I Kavouras, E Protopapadakis, A Doulamis, N Doulamis",
    "year": 2018,
    "source": "https://doi.org/10.1007/978-3-030-11935-5_26",
    "pdf": "assets/publications/pub1.pdf",
    "bibtex": "@InProceedings{kavouras_skeleton_2018,\nauthor=\"Kavouras, Ioannis\nand Protopapadakis, Eftychios\nand Doulamis, Anastasios\nand Doulamis, Nikolaos\",\neditor=\"Auer, Michael E.\nand Tsiatsos, Thrasyvoulos\",\ntitle=\"Skeleton Extraction of Dance Sequences from 3D Points Using Convolutional Neural Networks Based on a New Developed C3D Visualization Interface\",\nbooktitle=\"The Challenges of the Digital Transformation in Education\",\nyear=\"2019\",\npublisher=\"Springer International Publishing\",\naddress=\"Cham\",\npages=\"267--279\",\nabstract=\"A combined approach, involving 3D spatial datasets, noise removal prepossessing and deep learning regression approaches for the estimation of rough skeleton data, is presented in this paper. The application scenario involved data sequences from Greek traditional dances. In particular, a visualization application interface was developed allowing the user to load the C3D sequences, edit the data and remove possible noise. The interface was developed using the OpenGL language and is able to parse aby C3D format file. The interface is supported by several functionalities such as a pre-processing of the 3D point data and noise removal of 3D points that fall apart from the human skeleton. The main research innovation of this paper is the use of a deep machine learning framework through which human skeleton can be extracted. The points are selected on the use of a Convolutional Neural Network (CNN) model. Experimental results on real-life dances being captured by the Vicon motion capturing system are presented to show the great performance of the proposed scheme.\",\nisbn=\"978-3-030-11935-5\"\n}",
    "citation": "Kavouras, I., Protopapadakis, E., Doulamis, A., Doulamis, N. (2019). Skeleton Extraction of Dance Sequences from 3D Points Using Convolutional Neural Networks Based on a New Developed C3D Visualization Interface. In: Auer, M., Tsiatsos, T. (eds) The Challenges of the Digital Transformation in Education. ICL 2018. Advances in Intelligent Systems and Computing, vol 917. Springer, Cham. https://doi.org/10.1007/978-3-030-11935-5_26"
  }
]